print("野兽先辈XX说自动论证机")
name = input("你想论证的人是?")
sex = input("他/他的性别是?(男性或者女性)")
true = input("他是在现实中存在的人吗?(是或不是):")
hurt = input("他是否被当成群友的乐子?(是或不是):")
win = input("他做过的好事:")
fail = input("他做过的坏事:")
want = input("他的梦想:")
print("迄今为止，野兽先辈的身份说法已经有1145141919810种，笔者今天经过考证发现了另一种可能！野兽先辈的本体乃是" + name +"！论证如下:")
if sex == "男性":
    print("1." + name + "是男性，野兽先辈也是男性")
else:
    print("1." + name + "是女性，野兽先辈喜欢男人，也是女性(暴论)")
if true == "是":
    print("2.野兽先辈在《真夏夜的银梦》中本色出演，事真实存在的人物；而" + name + "也在三次元中真实存在。")
else:
    print("2." + name + "事虚拟人物；而先辈也是《真夏夜的银梦》中的虚拟人物。")
if hurt == "是":
    print("3.先辈遭到n站无数人迫害，是屑。而" + name +"也被群友迫害，也是屑")
else:
    print("3.先辈遭到n站无数人迫害却顽强地站起来爆破nico本社，是鉴。而" + name + "没有被群友迫害过，也是鉴")
print("4.野兽先辈关心后辈(大嘘)，事鉴;" + name + win + "，也是鉴")
print("5.野兽先辈雷普后辈，事屑；" + name + fail +"，也事屑。")
print("6." + name + want + "，事王道征途；野兽先辈也崇尚王道征途。")
print("最后，没有任何证据表明" + name + "一定不事野兽先辈。而基于以上论据，以及“如果一个东西长得像鸭子，游泳像鸭子，叫声像鸭子，那么它就是鸭子”的原理，我们可以完全确信，" + name + "就事野兽先辈。")
print("Q.E.D")
close = input("Press <Enter>")